const banners = [
  //1
  {
    img: "https://avatars.mds.yandex.net/get-ott/2419418/2a00000188533e9ba4bd77a13a9e3073ac19/1600x1200",
    logo: "https://static.okko.tv/images/v2/20841996?width=504&scale=1.2&quality=80&mediaType=webp",
    name: "Джоун Уик 4",
    rating: 8.1,
    released: "2023",
    categories: "Боевики",
    time: "2 ч 43 мин",
    lg: " Rus, Eng",
    ageLimit: "18+",
    description:
      "Одинокий киллер не сможет нормально жить, пока не расправится с Правлением кланов. Эталонный боевик экшн-франшизы",
    director: "Чад Стахелски",
    actors: "Киану Ривз, Донни Йен, Билл Скарсгард",
    detailedDescription:
      "На Джона Уика (Киану Ривз) продолжается охота, а киллер-изгой в свою очередь пытается разобраться со всеми членами Правления кланов. Враги натворили уже столько дел, что живым из этого противостояния не сможет выйти никто. Уик отправляется в Марокко и убивает Старейшину (Джордж Джорджиу), единственного человека, стоящего выше Правления. Управляющего отелем «Континенталь» Уинстона Скотта (Иэн Макшейн) и его консьержа Харона (Лэнс Реддик) вызывает к себе высокопоставленный член Правления маркиз Венсан де Грамон (Билл Скарсгард). Он отчитывает опытных профессионалов, словно они школьники. Маркиз едет в Париж и для убийства Джона с помощью шантажа нанимает его друга — слепого мастера Каина (Донни Йен). Как и всегда, спокойной жизни у Джона Уика не будет. Четвёртую часть виртуозной экшен-франшизы, которая с каждой новой частью становится только лучше, снял Чад Стахелски, автор «Джона Уика 2» и «Джона Уика 3». Первую часть саги он сделал вместе с Дэвидом Литчем. Мрачный боевик с Киану Ривзом уверенно становится одним из лучших представителей жанра в XXI века — от невероятно придуманных драк и перестрелок захватывает дыхание, волна экшена накрывает зрителей с головой.",
    comments: [
      {
        name: "John",
        description: "Отличный фильм",
      },
    ],
  },
  //2
  {
    img: "https://occ-0-325-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABdYkHwZZYZ4cYPZ20OWPg4dml1YWoI5TnX0ALc_4rHEkyvokTlifJKLD2U_ypf2wNi9Jc6Jigr53o-0syqQFrB0TLUIk1A-k1U3z.jpg?r=720",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/tx1O544a9T7n8Z_G12qaboulQQE/AAAABZBPW6_yz7KXFStvM6ypMwYrIJiaP6uXJMIcONwthg19oM0Lw_ynIG0Pv8G7QeqTL6_ZTdrVRjPfF7rkTlOXAE8Gqe5gq4oghS_hGBusB5VK_mfpKgSewqCnPJFz6Ruk-M20bVJ2ppe3NPzmcIZ3nbVQnIreTGi0TzOyv2CkvxWviZw_I45-5Q.png?r=721",
    name: "Тайлер Рейк: операция по спасению 2",
    rating: 7.6,
    released: "2023",
    categories: "Экшен",
    time: "2 ч. 3 мин.",
    lg: " Rus, Eng",
    ageLimit: "18+",
    description:
      "Вырвавшись из лап смерти, высококвалифицированный спецназовец Тайлер Рейк берется за новую опасную миссию. В этот раз он должен спасти семью безжалостного гангстера.",
    director: "Сэм Харгрейв3",
    actors: "Крис Хемсворт,Голшифте Фарахани,Торнике Гогричиани",
    detailedDescription:
      "Получив тяжёлые ранения в Бангладеш, наёмник Тайлер Рейк впадает в кому. Очнувшись, он постепенно начинает адаптироваться к новой мирной жизни. Однако о покое придётся забыть, поскольку ему поручают спасти семью опасного и жестокого бандита, которую содержат в хорошо охраняемой тюрьме в Грузии.",
    comments: [
      {
        name: "Алексей - 4002",
        description:
          "Тем, кто смотрел первую часть, нет смысла читать рецензии ко второй, ведь кроме локаций (а соответственно и цветокоррекции, больше никакого желтого фильтра) тут ничего не поменялось. Хорошо это или плохо каждый решит для себя. Лично я получил именно то, что хотел. Ну а если первую часть вы не смотрели, то это не сильно помешает насладиться второй, потому что в обоих картинах сильные стороны заключаются далеко не в сценарии и сюжете, а в брутальном и круто поставленном экшене, за которым легко следить благодаря четкой и выверенной операторской работе. В частности стоит выделить потрясающую сцену в первом акте, снятую 'одним' дублем. Подобная была и в первом фильме и длилась 12 минут. На этот раз ее хронометраж составил аж 21 минуту, и на ее протяжении главный герой успел не только раскидать толпу тюремных заключенных и охранников, но и прокатиться на бронированном гелендвагене с гранатометом в руке, сбить вертолет с М240, стоя",
      },
    ],
  },
  //3
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABe_uERyx2Cdna-Tnj6hFsakKndcGCXpkVwG9Xk-MYwocVqBWQyVSMYEOZeto-TJV2KbIr7l_fUGo9Ijv4ouGjs5Vi9WxjPCBa9gO.jpg?r=775",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/tx1O544a9T7n8Z_G12qaboulQQE/AAAABUn1tgAg6aJnRWrfHu4ic6fDysQqVlUDkg6iFQLHyCmeLhMGPj9cVfdgDPHZo5rGaj0mlBw1thbzy7MIsfQ6VsAwo6gdrmlMJzDEad55T8Qdli_BYEWO8nAwo7NRwr04DnDvU4SJVbEIy3QVEsReNF9GSB4JEP1xUTjUigSxrGgoO_agpaCZaQ.png?r=a01",
    name: "Тайлер Рейк: операция по спасению",
    rating: 6.8,
    released: "2020",
    categories: "боевик, криминал",
    time: "1 ч. 58 мин.",
    lg: " Rus, Eng",
    ageLimit: "18+",
    description:
      "И без того непростая миссия наемника превращается в отчаянную борьбу за жизнь, когда его отправляют в Бангладеш спасти похищенного сына наркобарона.",
    director: "Сэм Харгрейв",
    actors: "Крис Хемсворт,Рудракш Джайсвал,Рандип Худа",
    detailedDescription:
      "Группировка наёмников берётся освободить из заложников сына сидящего в тюрьме индийского наркобарона. Подростка похитили конкуренты и держат его в столице Бангладеш Дакке — городе, состоящем из трущоб и практически полностью окружённом реками. Ответственное задание поручается бывшему военному Тайлеру Рейку. Он легко расправляется с вооружённой охраной и быстро освобождает пленника, но доставить парня в безопасное место и выбраться из города, где на тебя объявлена охота, оказывается не так-то просто.",
    comments: [
      {
        name: "Alex Croft",
        description:
          "Сколько существует кинематограф, столько же те или иные актеры и деятели кинематографа охотно пытались попробовать свои силы в режиссуре. Последние годы количество желающих 'встать по другую сторону' камеры так вовсе увеличилось и внушительное количество актеров, сценаристов, продюсеров и других представителей мира кинематографа решили попробовать себя в новом для себя творчеством амплуа, а некоторые даже закрепились в нем. Решил приобщиться к этому и режиссер данной ленты Сэм Хардгрейв, который до этого успел поработать с командой авторов 'Джона Уика' Дэвида Литча и Чада Стахелски в качестве каскадера в 'Атомной блондинке', 'Хищных птицах' и ряде других картин, а также собственноручно поставив трюки и экшн сцены в таких фильмах как 'Первый мститель: Противостояние' (та что 'Гражданской война') и 'Мстители: Финал'.",
      },
    ],
  },
  //4
  {
    img: "https://occ-0-325-395.1.nflxso.net/dnm/api/v6/E8vDc_W8CLv7-yMQu8KMEC7Rrr8/AAAABWKGgnBjiY4Z7-YR15aDCzSabW03WezogOWZfwDVi_NwaA7iFmEt7_b4l7qDaJfPImW3Z9Hv9MviFmimG3Y9H-nw1sy-pUUNqicD.jpg?r=a90",
    logo: "https://occ-0-325-395.1.nflxso.net/dnm/api/v6/LmEnxtiAuzezXBjYXPuDgfZ4zZQ/AAAABcGpghXf8lyDuS4qCg5VrYUpWa9l1BPuWh2rDV4KHqIEoKQjHP84e0r_-Mb682zb-AEXLg9C1NTW69bQ_sTJZkFF3yBE-yWTBppOg20JWzyU.png?r=464",
    name: "Зверопой 2",
    rating: 8.3,
    released: "2021",
    categories: "Для детей",
    time: "1 ч. 49 мин.",
    lg: " Rus, Eng",
    ageLimit: "7+",
    description:
      "Бастер Мун и его друзья-музыканты должны убедить рокера-отшельника Клэя Кэллоуя присоединиться к ним и выступить на открытии их нового шоу.",
    director: "Гарт Дженнингс, Кристоф Лурделе",
    actors: "Гарт Дженнингс, Кристоф Лурделе",
    detailedDescription:
      "Тяжело быть продюсером, когда ты коала и у тебя лапки. Еще сложнее, когда твоя верная помощница древнее печатной машинки. И совсем весело, когда твоя труппа — это танцующий без остановки пухляш, колючая девочка-панк, застенчивая школьница, верзила-гангстер и многодетная мама, чьи дети — поросята в прямом смысле слова. Рецепт успеха прост — рвануть в мировую столицу развлечений, завербовать легендарного рок-музыканта и взорвать сцену новым шоу.",
    comments: [
      {
        name: "akdubr ",
        description:
          "Первая часть Зверопоя вышла в 2016 году на волне ажиотажа очень приятного Зверополиса. Неувязка одна: Зверополис делал Disney, который всегда качественно двигает сюжет и прорабатывает ключевых персонажей, в то время как за разработку Зверопоя взялась заклеймившая себя шаблонными и пустыми работами студия Illumination. Мультфильм не стал откровением, собрав в себе уйму сюжетных недоработок, загубивших интерес истории. Однако, впитав в себя уйму популярных песен и именитых актёров и преподнеся их в формате масштабного шоу, он смог ухватиться за нишу фильмов-аттракционов, не поражающих содержанием, но развлекающих действием. После проката мультфильм собрал хоть и разнящиеся, но в среднем приятные отзывы целевой аудитории, исключительно на которую и работает студия Illumination, что и предопределило скорое появление второй части. В конце 2021 года она появилась на экранах кинотеатров...",
      },
    ],
  },
  //5
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABeuLu02BBo86oDfqNwnrXG74IvR9VVjl2eLSDCOm_VBApCo1Xv1-fm2-qV3knx1ofOla9tfriiLuWq8PDjU44YE2B6AnLh2KUqhk.jpg?r=b38",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/tx1O544a9T7n8Z_G12qaboulQQE/AAAABfksN9uiI42_VQdj4JuRWwP57J6Lhpkr_6_KpY9lg_dTJbKxi5pdrhrwyNCP84qatuiR2Wk5MEQH54Xgx5Oh5ICUUqJJ0EaBBCId3u9NFhVx748ejog9X-Z0Bm2ov87wBvT_73xr6CPP6pVzqWTXYr0Esz0KlyDKbSpEzrDPzBIoh-tGIcbTMg.png?r=d98",
    name: "Кровь и золото",
    rating: 6.2,
    released: "2023",
    categories: "боевик, драма, военный, история",
    time: "1 ч. 38 мин.",
    lg: " Rus, Eng",
    ageLimit: "18+",
    description:
      "В конце Второй мировой войны немецкий дезертир и молодая женщина оказываются посреди кровавой схватки с группой нацистов, которые ищут спрятанное золото.",
    director: "Петер Торварт",
    actors: "Роберт Маазер,Мари Хахэ,Александр Шеер",
    detailedDescription:
      "Германия, весна 1945 года. В поисках тайника с золотом отряд эсэсовцев входит в городок Зонненберг, но в бой с ними вступают дезертир и несколько местных жителей.",
    comments: [
      {
        name: " ",
        description: "",
      },
    ],
  },
  //6
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABRGW1g5Y5U5v1DQVFm5c7cKmL5_K2YuVoWXGL8dTcoYsdFjytACDsLNJEou_QruWQGMa9l_JByRkKiYmO0nwcrP-lnPZOtFAWwv1.jpg?r=f8c",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/tx1O544a9T7n8Z_G12qaboulQQE/AAAABU1BzChy7_UqZvZyBVfuKazxksEwcUutrRp6qQ32z-9Qwtro-76u3P2jzty01Vk_7BeLAdw5TWH1GQF5XMbJAHZgSHjMVCmD5SBHYBhLdFXiPxdswYVJwg3fIzSo_lhWEt9G13Gz25lhsS9tLYOKuO3XIsWo16JE3t4qGOXN9ouu8g0EfxRwvg.png?r=a72",
    name: "Губка Боб в бегах",
    rating: 6.3,
    released: "2020",
    categories: "мультфильм, комедия, приключения, семейный, мюзикл",
    time: "1 ч. 35 мин.",
    lg: " Rus, Eng",
    ageLimit: "7+",
    description:
      "Гэри, лучший друг Губки Боба, пропал. Нужно найти его! Губка Боб и Патрик отправляются далеко за пределы Бикини Боттома, чтобы спасти своего друга в розовой раковине.",
    director: " Винсент Уоллер, Дэйв Каннингэм, Стивен Хилленбёрг",
    actors: "Роберт Маазер,Мари Хахэ,Александр Шеер",
    detailedDescription:
      "Германия, весна 1945 года. В поисках тайника с золотом отряд эсэсовцев входит в городок Зонненберг, но в бой с ними вступают дезертир и несколько местных жителей.",
    comments: [
      {
        name: "mypsydirect ",
        description:
          "Я смотрю Губку Боба с его премьерного показа в России 1 сентября в 2002 г., как раз пошел в 1й класс. Тогда первая серия вызвала огромный восторг и остальные я смотрел взахлеб. Смотрел его несколько лет, но в какой-то момент серии стали скучными и даже потеряли свой былой шарм и некоторые смыслы, ведь сериал вовсе не так пуст, как может некоторым показаться. ",
      },
    ],
  },
  //7
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABRDMujY2nU6Rco8IJtpEbB6yfWEZ-7uSjHrqFhItaZW16Kai7LO_FN5vHF2D4kceEvnx_JsSXbRgQr2Xj0oKf-SARSTy6WcGfeqR.jpg?r=9fb",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/LmEnxtiAuzezXBjYXPuDgfZ4zZQ/AAAABfZS-SYWnrSV2A1IYlo-Ywx0CpAyDGJC_SB08slw3p8N9plTDKE84cIYUTsMLMQw7Lh3Z8Tkhvlm0LtT70cF3ALVuQAM3qb8x8VItXUWvSD4.png?r=d57",
    name: "Время",
    rating: 6.4    ,
    released: "2021",
    categories: "Триллеры",
    time: "1 ч. 48 мин.",
    lg: " Rus, Eng",
    ageLimit: "16+",
    description:
      "Семейный отдых на уединенном пляже оборачивается ужасающим открытием: время в этом месте течет иначе, и жизнь героев сокращается до одного дня.",
    director: "М. Найт Шьямалан",
    actors: "Роберт Маазер,Мари Хахэ,Александр Шеер",
    detailedDescription:
      "Отправившись в отпуск на тропический остров, семья с двумя детьми решает последовать совету менеджера отеля и посетить прекрасный уединенный пляж. Кроме них на пляже оказываются и другие постояльцы: семейство с маленькой дочкой, пара среднего возраста и популярный рэпер. Но вскоре расслабленный отдых сменяется паникой, когда компания обнаруживает труп и замечает, что дети вдруг начали очень быстро взрослеть.",
    comments: [
      {
        name: "DarkPrince ",
        description:
          "М. Найт Шьямалан - режиссер, бесспорно, талантливый, но частенько ему не хватает изобретательности. Даже отличная картина 'Шестое чувство' была не без недостатков. Новое же творение режиссера претендует на звание 'худшего триллера' 2021-ого года. И я это говорю абсолютно серьезно: отличная идея была просто чудовищно реализована командой создателей. ",
      },
    ],
  },
  // 8 
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABRDMujY2nU6Rco8IJtpEbB6yfWEZ-7uSjHrqFhItaZW16Kai7LO_FN5vHF2D4kceEvnx_JsSXbRgQr2Xj0oKf-SARSTy6WcGfeqR.jpg?r=9fb",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/LmEnxtiAuzezXBjYXPuDgfZ4zZQ/AAAABfZS-SYWnrSV2A1IYlo-Ywx0CpAyDGJC_SB08slw3p8N9plTDKE84cIYUTsMLMQw7Lh3Z8Tkhvlm0LtT70cF3ALVuQAM3qb8x8VItXUWvSD4.png?r=d57",
    name: "Время",
    rating: 6.4    ,
    released: "2021",
    categories: "Триллеры",
    time: "1 ч. 48 мин.",
    lg: " Rus, Eng",
    ageLimit: "16+",
    description:
      "Семейный отдых на уединенном пляже оборачивается ужасающим открытием: время в этом месте течет иначе, и жизнь героев сокращается до одного дня.",
    director: "М. Найт Шьямалан",
    actors: "Роберт Маазер,Мари Хахэ,Александр Шеер",
    detailedDescription:
      "Отправившись в отпуск на тропический остров, семья с двумя детьми решает последовать совету менеджера отеля и посетить прекрасный уединенный пляж. Кроме них на пляже оказываются и другие постояльцы: семейство с маленькой дочкой, пара среднего возраста и популярный рэпер. Но вскоре расслабленный отдых сменяется паникой, когда компания обнаруживает труп и замечает, что дети вдруг начали очень быстро взрослеть.",
    comments: [
      {
        name: "DarkPrince ",
        description:
          "М. Найт Шьямалан - режиссер, бесспорно, талантливый, но частенько ему не хватает изобретательности. Даже отличная картина 'Шестое чувство' была не без недостатков. Новое же творение режиссера претендует на звание 'худшего триллера' 2021-ого года. И я это говорю абсолютно серьезно: отличная идея была просто чудовищно реализована командой создателей. ",
      },
    ],
  },
  // 9    
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABQ8rr6Zhcp4nNmGP8JHZeQ35CKMEVsHcOZEUcRIKVt1rHxwtvBsZtjoaxgg5ORJtLHPEnpG82oswaoXHcNgQCJiGLPUKvktTYpMT.jpg?r=4ad",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/tx1O544a9T7n8Z_G12qaboulQQE/AAAABftma8_VH0oUZba9wCCwb3mGTrOZ3qQyQCTu_UAeTq4u-MeUn19nsK22oAOU6fTCz7vgapG7eUDXuc3oBLIza6vzl3rU9oUOSxHgihOSRGL94C8at1f7RhXOk6CuF6Gi0mfygg6rg7nHK70y3J63wL4EATwCtephoIjtL-MoCPfik6DgBPnFWg.png?r=97a",
    name: "Король клонирования",
    rating: 6.5    ,
    released: "2023",
    categories: "Документалистика о науке и природе",
    time: "1 ч. 25 мин.",
    lg: " Rus, Eng",
    ageLimit: "16+",
    description:
      "От новаторских исследований по клонированию человека до скандального краха — документальный фильм повествует о захватывающей истории самого известного корейского ученого.      ",
    director: "",
    actors: "",
    detailedDescription:
      "",
    comments: [
      {
        name: " ",
        description:
          "",
      },
    ],
  },
  // 10
  {
    img: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/6AYY37jfdO6hpXcMjf9Yu5cnmO0/AAAABcKmyS3IexoGcLR9qEsRCev3PVkxxuA1waviPBSLd0QESYsuFQD0Im6XdFPUkcbdrJS9rmjbbYiHV2NBaJbhgEsY1WduxPa8r5-F.jpg?r=0a7",
    logo: "https://occ-0-768-395.1.nflxso.net/dnm/api/v6/tx1O544a9T7n8Z_G12qaboulQQE/AAAABV43SZp5qPvZrysdr3jacHVbOFMC9IQDKjJf_T34j9bl_qjgrH91uKm4ckU7Vxeijn3BlEgja1TPCSrda7t7luUUBIR4G4ekDjPSulr8DjyEal2ccvNYt7koFtlEbgOKmXWUF_yUpDqdVnMIcouw8SOyd46SK3Fb4DDqgwVh76DKw7tSvZyt3w.png?r=917",
    name: " Шафт ",
    rating: 6.6    ,
    released: "2019",
    categories: "боевик, комедия, криминал, детектив",
    time: "1 ч. 52 мин.",
    lg: " Rus, Eng",
    ageLimit: "16+",
    description:
      "К отвязному частному детективу Джону Шафту обращается за помощью его сын, которого он никогда не видел, и оказывается, что между ними нет ничего общего. ",
    director: "Тим Стори",
    actors: "Сэмюэл Л. Джексон,Джесси Ашер,Реджина Холл",
    detailedDescription:
      "Джон Шафт III — специалист по кибербезопасности в ФБР, не привыкший решать проблемы грубой силой. Он предпочитает полагаться на логику и расчёт, но убийство лучшего друга ставит его в тупик. С ним не разобраться современными методами, так что Джону ничего не остается, кроме как обратиться за помощью к старшему поколению Шафтов, чьи старые методы помогут ему найти убийцу.",
    comments: [
      {
        name: "Distarneo ",
        description:
          "«Шафт» - легкий и незатейливый комедийно-криминальный детективный боевик станет для многих зрителей поистине приятным времяпровождением, который совершенно не напрягает и тем более не пытается кому-то понравится. Это абсолютно лайтовая история об опасных приключениях семьи Шафт, где каждый новый день солит немало проблем и трудностей, а тем временем сами герои всегда выходят сухими из воды с высоко поднятой головой, при этом добавляя в конце какую-нибудь шутейку на десерт.",
      },
    ],
  },
];

